Repository: Imran200216/taskapp
Catalog: lib/l10n/app_*.arb
Languages: ta

# authTitle
source: Welcome to TaskNotify
ta: TaskNotifyக்கு வருக.

# authSubTitle
source: Sign up or login below to manage your project, task and your productivity
ta: உங்கள் திட்டம், பணி மற்றும் உங்கள் உற்பத்தித்திறனை நிர்வகிக்க கீழே பதிவு செய்யவும் அல்லது உள்நுழையவும்.

source: Login
ta: உள்நுழைய

source: Sign Up
ta: பதிவு செய்

# appleLogin
source: Login with Apple
ta: ஆப்பிள் மூலம் உள்நுழையவும்

# googleLogin
source: Login with Google
ta: கூகிள் மூலம் உள்நுழையவும்

# continueWithEmail
source: or continue with email
ta: அல்லது மின்னஞ்சலுடன் தொடரவும்

# userNameHintText
source: Enter your name
ta: உங்கள் பெயரை உள்ளிடவும்

# emailHintText
source: Enter your email
ta: உங்கள் மின்னஞ்சலை உள்ளிடவும்

# passwordHintText
source: Enter your password
ta: உங்கள் கடவுச்சொல்லை உள்ளிடவும்

# confirmPasswordHintText
source: Enter your confirm password
ta: உங்கள் உறுதிப்படுத்தல் கடவுச்சொல்லை உள்ளிடவும்.

source: Forget Password?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா?

# forgetPasswordTitle
source: Forget Password
ta: கடவுச்சொல்லை மறந்துவிடு

# forgetPasswordSubTitle
source: Enter your email account to reset password
ta: கடவுச்சொல்லை மீட்டமைக்க உங்கள் மின்னஞ்சல் கணக்கை உள்ளிடவும்.

# continueText
source: Continue
ta: தொடரவும்

# backToLoginText
source: Back to Login
ta: உள்நுழைவுக்குத் திரும்பு

source: Home
ta: முகப்புப் பக்கம்

source: Archive
ta: காப்பகம்

source: Add Task
ta: பணியைச் சேர்

source: Proverb
ta: பழமொழி

source: Profile
ta: Pசுயவிவரம்

# taskNameHintText
source: Task name
ta: பணியின் பெயர்

# taskDescriptionHintText
source: Task description
ta: பணி விளக்கம்

source: My account
ta: எனது கணக்கு

source: Personal info
ta: தனிப்பட்ட தகவல்

source: Your name
ta: உங்கள் பெயர்

source: Your email address
ta: உங்கள் மின்னஞ்சல் முகவரி

source: App Info
ta: இந்த ஆப்ஸ் பற்றி

# taskNotifyAppInfoDescription
source: Tasify - Smart Task Management & Productivity
ta: டாசிஃபை - ஸ்மார்ட் டாஸ்க் மேலாண்மை & உற்பத்தித்திறன்

source: Dev Info
ta: டெவலப்பர் தகவல்

# devInfoSubTitle
source: About the Developer
ta: டெவலப்பர் பற்றி

source: Your Language
ta: உங்கள் மொழி

# yourLanguageSubTitle
source: Change your preferred language
ta: உங்களுக்கு விருப்பமான மொழியை மாற்றவும்

source: Logout
ta: வெளியேறு

# logoutSubTitle
source: You will be signed out from your account
ta: உங்கள் கணக்கிலிருந்து வெளியேற்றப்படுவீர்கள்.

# emailRequired
source: Email is required
ta: மின்னஞ்சல் அவசியம்

# invalidEmail
source: Enter a valid email address
ta: செல்லுபடியாகும் மின்னஞ்சல் முகவரியை உள்ளிடவும்.

# passwordRequired
source: Password is required
ta: கடவுச்சொல் தேவை.

# passwordMinLength
source: Password must be at least 6 characters long
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துகள் நீளமாக இருக்க வேண்டும்.

# confirmPasswordRequired
source: Confirm password is required
ta: கடவுச்சொல்லை உறுதிப்படுத்துவது அவசியம்.

source: Passwords do not match
ta: கடவுச்சொற்கள் பொருந்தவில்லை.

# nameRequired
source: Name is required
ta: பெயர் அவசியம்

# nameMinLength
source: Name must be at least 3 characters long
ta: பெயர் குறைந்தது 3 எழுத்துகள் நீளமாக இருக்க வேண்டும்.

source: No archive found
ta: காப்பகம் எதுவும் கிடைக்கவில்லை.

source: Task name
ta: பணியின் பெயர்

source: Task description
ta: பணி விளக்கம்

# dataRange
source: Pick a date range
ta: தேதி வரம்பைத் தேர்ந்தெடுக்கவும்

source: Notification alert
ta: அறிவிப்பு எச்சரிக்கை

source: Task Status
ta: பணி நிலை

# pendingStatus
source: Pending
ta: நிலுவையில் உள்ளது

# inProgressStatus
source: In Progress
ta: செயல்பாட்டில் உள்ளது

# completedStatus
source: Completed
ta: முடிந்தது

# overDueStatus
source: Overdue
ta: காலாவதியானது

source: Task Priority
ta: பணி முன்னுரிமை

# taskPriorityHigh
source: High
ta: உயர்

# taskPriorityMedium
source: Medium
ta: நடுத்தரம்

# taskPriorityLow
source: Low
ta: குறைந்த

source: Notification On
ta: அறிவிப்பு இயக்கப்பட்டது

source: Notification Off
ta: அறிவிப்பு முடக்கப்பட்டுள்ளது

source: ArchiveTask
ta: காப்பகப் பணி

# taskNameRequired
source: Task name is required
ta: பணியின் பெயர் அவசியம்.

# taskNameMinLength
source: Task name must be at least 3 characters long
ta: பணியின் பெயர் குறைந்தது 3 எழுத்துகள் நீளமாக இருக்க வேண்டும்.

# taskDescriptionRequired
source: Task description is required
ta: பணி விளக்கம் அவசியம்.

# taskDescriptionMinLength
source: Task description must be at least 10 characters long
ta: பணி விளக்கம் குறைந்தது 10 எழுத்துகள் நீளமாக இருக்க வேண்டும்.

# notificationRequired
source: Notification selection is required
ta: அறிவிப்புத் தேர்வு அவசியம்

# dateRangeRequired
source: Date range selection is required
ta: தேதி வரம்பைத் தேர்ந்தெடுக்க வேண்டும்.

# taskStatusRequired
source: Task status selection is required
ta: பணி நிலையைத் தேர்ந்தெடுக்க வேண்டும்.

# taskPriorityRequired
source: Task priority selection is required
ta: பணி முன்னுரிமைத் தேர்வு அவசியம்.

# emailAlreadyInUse
source: The email address is already in use.
ta: மின்னஞ்சல் முகவரி ஏற்கனவே பயன்படுத்தப்படுகிறது.

# operationNotAllowed
source: Email/password accounts are not enabled.
ta: மின்னஞ்சல்/கடவுச்சொல் கணக்குகள் செயல்படுத்தப்படவில்லை.

# weakPassword
source: The password is too weak.
ta: கடவுச்சொல் மிகவும் பலவீனமானது.

# userDisabled
source: This user account has been disabled.
ta: இந்த பயனர் கணக்கு முடக்கப்பட்டுள்ளது.

# userNotFound
source: No user found with this email.
ta: இந்த மின்னஞ்சலுடன் எந்த பயனரும் கிடைக்கவில்லை.

# wrongPassword
source: Incorrect password.
ta: தவறான கடவுச்சொல்.

# tooManyRequests
source: Too many login attempts. Please try again later.
ta: அதிகமான உள்நுழைவு முயற்சிகள். பிறகு முயற்சிக்கவும்.

# unexpectedError
source: An unexpected error occurred. Please try again.
ta: எதிர்பாராத தவறு ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.

# accountExistsWithDifferentCredential
source: This email is already associated with another sign-in method.
ta: இந்த மின்னஞ்சல் ஏற்கனவே மற்றொரு உள்நுழைவு முறையுடன் தொடர்புடையது.

# invalidCredential
source: The credential received is invalid.
ta: பெறப்பட்ட நற்சான்றிதழ் தவறானது.

# networkRequestFailed
source: Please check your internet connection and try again.
ta: உங்கள் இணைய இணைப்பை சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# appleSignInNotSupported
source: Apple Sign-In is only supported on iOS and macOS.
ta: ஆப்பிள் உள்நுழைவு iOS மற்றும் macOS இல் மட்டுமே ஆதரிக்கப்படுகிறது.

# appleSignInNotEnabled
source: Apple sign-in is not enabled for this Firebase project.
ta: இந்த Firebase திட்டத்தில் ஆப்பிள் உள்நுழைவு செயல்படுத்தப்படவில்லை.

# networkError
source: Check your internet connection and try again.
ta: உங்கள் இன்டர்நெட் இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# unknownError
source: An unknown error occurred. Please try again.
ta: திடீர் பிழை ஏற்பட்டுள்ளது. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# onBoardingTitleFirst
source: Stay Organized & Boost Productivity
ta: ஒழுங்காக இருங்கள் & உற்பத்தித்திறனை அதிகரிக்கவும்

# onBoardingSubTitleFirst
source: Effortlessly manage your tasks, collaborate with your team, and track progress in one place. With smart scheduling, AI-powered assistance, and real-time updates, Tasify helps you stay ahead of deadlines and achieve more! 🚀
ta: உங்கள் பணிகளை எளிதாக நிர்வகிக்கவும், உங்கள் குழுவுடன் இணைந்து செயல்படவும் மற்றும் முன்னேற்றத்தை ஒரே இடத்தில் கண்காணிக்கவும். புத்திசாலி நேரக்கணிப்பு, ஏஐ-ஆதரித்த உதவி மற்றும் நேரடி புதுப்பிப்புகளுடன், Tasify உங்களுக்கு காலக்கெடுவுக்கு முன் இருக்கவும் மேலும் சாதிக்கவும் உதவுகிறது! 🚀

# onBoardingTitleSecond
source: Organize, Plan & Achieve
ta: ஒழுங்கமை, திட்டமிடு & சாதி

# onBoardingSubTitleSecond
source: Stay on top of your tasks with smart planning, effortless collaboration, and real-time progress tracking. With Tasify, managing work has never been easier—boost productivity and accomplish more every day! ✅
ta: புத்திசாலி திட்டமிடல், எளிதான கூட்டணி மற்றும் நேரடி முன்னேற்ற கண்காணிப்புடன் உங்கள் பணிகளில் முன்னிலையில் இருங்கள். Tasify உடன், பணிய اد الاستدارة தாக முன் நிர்வகிக்க எளிதாக உள்ளது—உற்பத்தித்திறனை அதிகரிக்கவும், தினமும் அதிகம் சாதிக்கவும்! ✅

source: Permission denied
ta: அனுமதி மறுக்கப்பட்டது

source: Document not found
ta: ஆவணம் கிடைக்கவில்லை

source: Service unavailable
ta: சேவை கிடைக்கவில்லை

# addTaskToastSuccess
source: Task added successfully
ta: பணியானது வெற்றிகரமாக சேர்க்கப்பட்டது

# addTaskToastFailure
source: Failed to add task. Please try again.
ta: பணியைச் சேர்க்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.
