// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Tamil (`ta`).
class AppLocalizationsTa extends AppLocalizations {
  AppLocalizationsTa([String locale = 'ta']) : super(locale);

  @override
  String get authTitle => 'TaskNotifyக்கு வருக.';

  @override
  String get authSubTitle => 'உங்கள் திட்டம், பணி மற்றும் உங்கள் உற்பத்தித்திறனை நிர்வகிக்க கீழே பதிவு செய்யவும் அல்லது உள்நுழையவும்.';

  @override
  String get login => 'உள்நுழைய';

  @override
  String get signUp => 'பதிவு செய்';

  @override
  String get appleLogin => 'ஆப்பிள் மூலம் உள்நுழையவும்';

  @override
  String get googleLogin => 'கூகிள் மூலம் உள்நுழையவும்';

  @override
  String get continueWithEmail => 'அல்லது மின்னஞ்சலுடன் தொடரவும்';

  @override
  String get userNameHintText => 'உங்கள் பெயரை உள்ளிடவும்';

  @override
  String get emailHintText => 'உங்கள் மின்னஞ்சலை உள்ளிடவும்';

  @override
  String get passwordHintText => 'உங்கள் கடவுச்சொல்லை உள்ளிடவும்';

  @override
  String get confirmPasswordHintText => 'உங்கள் உறுதிப்படுத்தல் கடவுச்சொல்லை உள்ளிடவும்.';

  @override
  String get forgetPassword => 'கடவுச்சொல்லை மறந்துவிட்டீர்களா?';

  @override
  String get forgetPasswordTitle => 'கடவுச்சொல்லை மறந்துவிடு';

  @override
  String get forgetPasswordSubTitle => 'கடவுச்சொல்லை மீட்டமைக்க உங்கள் மின்னஞ்சல் கணக்கை உள்ளிடவும்.';

  @override
  String get continueText => 'தொடரவும்';

  @override
  String get backToLoginText => 'உள்நுழைவுக்குத் திரும்பு';

  @override
  String get home => 'முகப்புப் பக்கம்';

  @override
  String get archive => 'காப்பகம்';

  @override
  String get addTask => 'பணியைச் சேர்';

  @override
  String get proverb => 'பழமொழி';

  @override
  String get profile => 'Pசுயவிவரம்';

  @override
  String get taskNameHintText => 'பணியின் பெயர்';

  @override
  String get taskDescriptionHintText => 'பணி விளக்கம்';

  @override
  String get myAccount => 'எனது கணக்கு';

  @override
  String get personalInfo => 'தனிப்பட்ட தகவல்';

  @override
  String get yourName => 'உங்கள் பெயர்';

  @override
  String get yourEmailAddress => 'உங்கள் மின்னஞ்சல் முகவரி';

  @override
  String get appInfo => 'இந்த ஆப்ஸ் பற்றி';

  @override
  String get taskNotifyAppInfoDescription => 'டாசிஃபை - ஸ்மார்ட் டாஸ்க் மேலாண்மை & உற்பத்தித்திறன்';

  @override
  String get devInfo => 'டெவலப்பர் தகவல்';

  @override
  String get devInfoSubTitle => 'டெவலப்பர் பற்றி';

  @override
  String get yourLanguage => 'உங்கள் மொழி';

  @override
  String get yourLanguageSubTitle => 'உங்களுக்கு விருப்பமான மொழியை மாற்றவும்';

  @override
  String get logout => 'வெளியேறு';

  @override
  String get logoutSubTitle => 'உங்கள் கணக்கிலிருந்து வெளியேற்றப்படுவீர்கள்.';

  @override
  String get emailRequired => 'மின்னஞ்சல் அவசியம்';

  @override
  String get invalidEmail => 'செல்லுபடியாகும் மின்னஞ்சல் முகவரியை உள்ளிடவும்.';

  @override
  String get passwordRequired => 'கடவுச்சொல் தேவை.';

  @override
  String get passwordMinLength => 'கடவுச்சொல் குறைந்தது 6 எழுத்துகள் நீளமாக இருக்க வேண்டும்.';

  @override
  String get confirmPasswordRequired => 'கடவுச்சொல்லை உறுதிப்படுத்துவது அவசியம்.';

  @override
  String get passwordsDoNotMatch => 'கடவுச்சொற்கள் பொருந்தவில்லை.';

  @override
  String get nameRequired => 'பெயர் அவசியம்';

  @override
  String get nameMinLength => 'பெயர் குறைந்தது 3 எழுத்துகள் நீளமாக இருக்க வேண்டும்.';

  @override
  String get noArchiveFound => 'காப்பகம் எதுவும் கிடைக்கவில்லை.';

  @override
  String get taskName => 'பணியின் பெயர்';

  @override
  String get taskDescription => 'பணி விளக்கம்';

  @override
  String get dataRange => 'தேதி வரம்பைத் தேர்ந்தெடுக்கவும்';

  @override
  String get notificationAlert => 'அறிவிப்பு எச்சரிக்கை';

  @override
  String get taskStatus => 'பணி நிலை';

  @override
  String get pendingStatus => 'நிலுவையில் உள்ளது';

  @override
  String get inProgressStatus => 'செயல்பாட்டில் உள்ளது';

  @override
  String get completedStatus => 'முடிந்தது';

  @override
  String get overDueStatus => 'காலாவதியானது';

  @override
  String get taskPriority => 'பணி முன்னுரிமை';

  @override
  String get taskPriorityHigh => 'உயர்';

  @override
  String get taskPriorityMedium => 'நடுத்தரம்';

  @override
  String get taskPriorityLow => 'குறைந்த';

  @override
  String get notificationOn => 'அறிவிப்பு இயக்கப்பட்டது';

  @override
  String get notificationOff => 'அறிவிப்பு முடக்கப்பட்டுள்ளது';

  @override
  String get archiveTask => 'காப்பகப் பணி';

  @override
  String get taskNameRequired => 'பணியின் பெயர் அவசியம்.';

  @override
  String get taskNameMinLength => 'பணியின் பெயர் குறைந்தது 3 எழுத்துகள் நீளமாக இருக்க வேண்டும்.';

  @override
  String get taskDescriptionRequired => 'பணி விளக்கம் அவசியம்.';

  @override
  String get taskDescriptionMinLength => 'பணி விளக்கம் குறைந்தது 10 எழுத்துகள் நீளமாக இருக்க வேண்டும்.';

  @override
  String get notificationRequired => 'அறிவிப்புத் தேர்வு அவசியம்';

  @override
  String get dateRangeRequired => 'தேதி வரம்பைத் தேர்ந்தெடுக்க வேண்டும்.';

  @override
  String get taskStatusRequired => 'பணி நிலையைத் தேர்ந்தெடுக்க வேண்டும்.';

  @override
  String get taskPriorityRequired => 'பணி முன்னுரிமைத் தேர்வு அவசியம்.';

  @override
  String get emailAlreadyInUse => 'மின்னஞ்சல் முகவரி ஏற்கனவே பயன்படுத்தப்படுகிறது.';

  @override
  String get operationNotAllowed => 'மின்னஞ்சல்/கடவுச்சொல் கணக்குகள் செயல்படுத்தப்படவில்லை.';

  @override
  String get weakPassword => 'கடவுச்சொல் மிகவும் பலவீனமானது.';

  @override
  String get userDisabled => 'இந்த பயனர் கணக்கு முடக்கப்பட்டுள்ளது.';

  @override
  String get userNotFound => 'இந்த மின்னஞ்சலுடன் எந்த பயனரும் கிடைக்கவில்லை.';

  @override
  String get wrongPassword => 'தவறான கடவுச்சொல்.';

  @override
  String get tooManyRequests => 'அதிகமான உள்நுழைவு முயற்சிகள். பிறகு முயற்சிக்கவும்.';

  @override
  String get accountExistsWithDifferentCredential => 'இந்த மின்னஞ்சல் ஏற்கனவே மற்றொரு உள்நுழைவு முறையுடன் தொடர்புடையது.';

  @override
  String get invalidCredential => 'பெறப்பட்ட நற்சான்றிதழ் தவறானது.';

  @override
  String get networkRequestFailed => 'உங்கள் இணைய இணைப்பை சரிபார்த்து மீண்டும் முயற்சிக்கவும்.';

  @override
  String get unexpectedError => 'எதிர்பாராத தவறு ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.';

  @override
  String get appleSignInNotSupported => 'ஆப்பிள் உள்நுழைவு iOS மற்றும் macOS இல் மட்டுமே ஆதரிக்கப்படுகிறது.';

  @override
  String get appleSignInNotEnabled => 'இந்த Firebase திட்டத்தில் ஆப்பிள் உள்நுழைவு செயல்படுத்தப்படவில்லை.';

  @override
  String get networkError => 'உங்கள் இன்டர்நெட் இணைப்பைச் சரிபார்த்து மீண்டும் முயற்சிக்கவும்.';

  @override
  String get unknownError => 'திடீர் பிழை ஏற்பட்டுள்ளது. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.';

  @override
  String get onBoardingTitleFirst => 'ஒழுங்காக இருங்கள் & உற்பத்தித்திறனை அதிகரிக்கவும்';

  @override
  String get onBoardingSubTitleFirst => 'உங்கள் பணிகளை எளிதாக நிர்வகிக்கவும், உங்கள் குழுவுடன் இணைந்து செயல்படவும் மற்றும் முன்னேற்றத்தை ஒரே இடத்தில் கண்காணிக்கவும். புத்திசாலி நேரக்கணிப்பு, ஏஐ-ஆதரித்த உதவி மற்றும் நேரடி புதுப்பிப்புகளுடன், Tasify உங்களுக்கு காலக்கெடுவுக்கு முன் இருக்கவும் மேலும் சாதிக்கவும் உதவுகிறது! 🚀';

  @override
  String get onBoardingTitleSecond => 'ஒழுங்கமை, திட்டமிடு & சாதி';

  @override
  String get onBoardingSubTitleSecond => 'புத்திசாலி திட்டமிடல், எளிதான கூட்டணி மற்றும் நேரடி முன்னேற்ற கண்காணிப்புடன் உங்கள் பணிகளில் முன்னிலையில் இருங்கள். Tasify உடன், பணிய اد الاستدارة தாக முன் நிர்வகிக்க எளிதாக உள்ளது—உற்பத்தித்திறனை அதிகரிக்கவும், தினமும் அதிகம் சாதிக்கவும்! ✅';

  @override
  String get permissionDenied => 'அனுமதி மறுக்கப்பட்டது';

  @override
  String get documentNotFound => 'ஆவணம் கிடைக்கவில்லை';

  @override
  String get serviceUnavailable => 'சேவை கிடைக்கவில்லை';

  @override
  String get addTaskToastSuccess => 'பணியானது வெற்றிகரமாக சேர்க்கப்பட்டது';

  @override
  String get addTaskToastFailure => 'பணியைச் சேர்க்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.';
}
